; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v5 ?v12)
             (pred_9 ?v8 ?v1)
             (pred_3 ?v5 ?v1)
             (pred_4 ?v9 ?v5 )
	     (pred_1 ?v5)
             (pred_6 ?v4)
             (pred_2 ?v8)
             (pred_11 ?v1)
             (pred_10 ?v5)
             (pred_7 ?v8)
             (pred_5 ?v5)
             (pred_8 ))



(:action op_1
:parameters (?v3 ?v2 ?v13 ?v7)
:precondition (and (pred_6 ?v3) (pred_6 ?v2) (pred_2 ?v13) (pred_11 ?v7)
          (pred_12 ?v3 ?v2) (pred_9 ?v13 ?v7)
                   (pred_3 ?v2 ?v7) (pred_1 ?v3) 
                   (pred_10 ?v2) (pred_7 ?v13))
:effect (and  (pred_5 ?v2) (not (pred_10 ?v2))))


(:action op_3
:parameters (?v3 ?v6)
:precondition (and (pred_6 ?v3) (pred_6 ?v6)
               (pred_1 ?v3) (pred_12 ?v3 ?v6) (pred_5 ?v6))
:effect (and (pred_1 ?v6) (not (pred_1 ?v3))))

(:action op_2
:parameters (?v3 ?v13)
:precondition (and (pred_6 ?v3) (pred_2 ?v13) 
                  (pred_1 ?v3) (pred_4 ?v13 ?v3) (pred_8 ))
:effect (and (pred_7 ?v13)
   (not (pred_4 ?v13 ?v3)) (not (pred_8 ))))


(:action op_4
:parameters (?v3 ?v10 ?v11)
:precondition (and (pred_6 ?v3) (pred_2 ?v10) (pred_2 ?v11)
                  (pred_1 ?v3) (pred_7 ?v11) (pred_4 ?v10 ?v3))
:effect (and (pred_7 ?v10) (pred_4 ?v11 ?v3)
        (not (pred_7 ?v11)) (not (pred_4 ?v10 ?v3))))

(:action op_5
:parameters (?v3 ?v13)
:precondition (and (pred_6 ?v3) (pred_2 ?v13) 
                  (pred_1 ?v3) (pred_7 ?v13))
:effect (and (pred_8 ) (pred_4 ?v13 ?v3) (not (pred_7 ?v13)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_18 obj_05 obj_01 obj_07 obj_19 obj_10 obj_04 obj_13 obj_20 obj_08 obj_16 obj_09 obj_03 obj_21 obj_02
    obj_11 obj_15
    obj_06 obj_12 obj_17
    )

    (:init
       (pred_8)

       (pred_6 obj_14)
       (pred_6 obj_18)
       (pred_6 obj_05)
       (pred_6 obj_01)
       (pred_6 obj_07)
       (pred_6 obj_19)
       (pred_6 obj_10)
       (pred_6 obj_04)
       (pred_6 obj_13)
       (pred_6 obj_20)
       (pred_6 obj_08)
       (pred_6 obj_16)
       (pred_6 obj_09)
       (pred_6 obj_03)
       (pred_6 obj_21)
       (pred_6 obj_02)
       (pred_11 obj_11)
       (pred_11 obj_15)
       (pred_2 obj_06)
       (pred_2 obj_12)
       (pred_2 obj_17)

       (pred_12 obj_14 obj_07)
       (pred_12 obj_14 obj_18)
       (pred_12 obj_18 obj_19)
       (pred_12 obj_18 obj_05)
       (pred_12 obj_18 obj_14)
       (pred_12 obj_05 obj_10)
       (pred_12 obj_05 obj_01)
       (pred_12 obj_05 obj_18)
       (pred_12 obj_01 obj_04)
       (pred_12 obj_01 obj_05)
       (pred_12 obj_07 obj_13)
       (pred_12 obj_07 obj_19)
       (pred_12 obj_07 obj_14)
       (pred_12 obj_19 obj_20)
       (pred_12 obj_19 obj_10)
       (pred_12 obj_19 obj_18)
       (pred_12 obj_19 obj_07)
       (pred_12 obj_10 obj_08)
       (pred_12 obj_10 obj_04)
       (pred_12 obj_10 obj_05)
       (pred_12 obj_10 obj_19)
       (pred_12 obj_04 obj_16)
       (pred_12 obj_04 obj_01)
       (pred_12 obj_04 obj_10)
       (pred_12 obj_13 obj_09)
       (pred_12 obj_13 obj_20)
       (pred_12 obj_13 obj_07)
       (pred_12 obj_20 obj_03)
       (pred_12 obj_20 obj_08)
       (pred_12 obj_20 obj_19)
       (pred_12 obj_20 obj_13)
       (pred_12 obj_08 obj_21)
       (pred_12 obj_08 obj_16)
       (pred_12 obj_08 obj_10)
       (pred_12 obj_08 obj_20)
       (pred_12 obj_16 obj_02)
       (pred_12 obj_16 obj_04)
       (pred_12 obj_16 obj_08)
       (pred_12 obj_09 obj_03)
       (pred_12 obj_09 obj_13)
       (pred_12 obj_03 obj_21)
       (pred_12 obj_03 obj_20)
       (pred_12 obj_03 obj_09)
       (pred_12 obj_21 obj_02)
       (pred_12 obj_21 obj_08)
       (pred_12 obj_21 obj_03)
       (pred_12 obj_02 obj_16)
       (pred_12 obj_02 obj_21)
       (pred_10 obj_19)
       (pred_10 obj_04)
       (pred_10 obj_05)
       (pred_3  obj_19 obj_11)
       (pred_3  obj_04 obj_15)
       (pred_3  obj_05 obj_15)
       (pred_5 obj_14)
       (pred_5 obj_18)
       (pred_5 obj_01)
       (pred_5 obj_07)
       (pred_5 obj_10)
       (pred_5 obj_13)
       (pred_5 obj_20)
       (pred_5 obj_08)
       (pred_5 obj_16)
       (pred_5 obj_09)
       (pred_5 obj_03)
       (pred_5 obj_21)
       (pred_5 obj_02)

       (pred_9  obj_06 obj_11)
       (pred_9  obj_12 obj_15)
       (pred_9  obj_17 obj_11)
       (pred_4 obj_06 obj_03)
       (pred_4 obj_12 obj_14)
       (pred_4 obj_17 obj_08)
       (pred_1 obj_16)
    )

    (:goal (and
       (pred_4 obj_06 obj_13)
       (pred_4 obj_12 obj_02)
    ))
(:constraints
  (always (not (pred_1 obj_20)))
)
)

; plan
1. (op_3 obj_16 obj_02)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_02)
   goals met: 0 of 2
2. (op_3 obj_02 obj_21)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_21)
   goals met: 0 of 2
3. (op_3 obj_21 obj_03)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_03)
   goals met: 0 of 2
4. (op_2 obj_03 obj_06)
   deleted: (pred_4 obj_06 obj_03) (pred_8)
   added: (pred_7 obj_06)
   goals met: 0 of 2
5. (op_3 obj_03 obj_09)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_09)
   goals met: 0 of 2
6. (op_3 obj_09 obj_13)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_13)
   goals met: 0 of 2
7. (op_5 obj_13 obj_06)
   deleted: (pred_7 obj_06)
   added: (pred_8) (pred_4 obj_06 obj_13)
   goals met: 1 of 2
8. (op_3 obj_13 obj_07)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_07)
   goals met: 1 of 2
9. (op_3 obj_07 obj_14)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_14)
   goals met: 1 of 2
10. (op_2 obj_14 obj_12)
   deleted: (pred_4 obj_12 obj_14) (pred_8)
   added: (pred_7 obj_12)
   goals met: 1 of 2
11. (op_3 obj_14 obj_07)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_07)
   goals met: 1 of 2
12. (op_3 obj_07 obj_13)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_13)
   goals met: 1 of 2
13. (op_3 obj_13 obj_09)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_09)
   goals met: 1 of 2
14. (op_3 obj_09 obj_03)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_03)
   goals met: 1 of 2
15. (op_3 obj_03 obj_21)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_21)
   goals met: 1 of 2
16. (op_3 obj_21 obj_02)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_02)
   goals met: 1 of 2
17. (op_5 obj_02 obj_12)
   deleted: (pred_7 obj_12)
   added: (pred_8) (pred_4 obj_12 obj_02)
   goals met: 2 of 2
